(function ($) {
    $.extend($.summernote.lang, {
        'fa-IR': {
            font: {
                bold: 'Ø¯Ø±Ø´Øª',
                italic: 'Ø®Ù…ÛŒØ¯Ù‡',
                underline: 'Ù…ÛŒØ§Ù† Ø®Ø·',
                strikethrough: 'Strike',
                clear: 'Ù¾Ø§Ú© Ú©Ø±Ø¯Ù† ÙØ±Ù…Øª ÙÙˆÙ†Øª',
                height: 'ÙØ§ØµÙ„Ù‡ ÛŒ Ø®Ø·ÛŒ',
                name: 'Ø§Ø³Ù… ÙÙˆÙ†Øª',
                size: 'Ø§Ù†Ø¯Ø§Ø²Ù‡ ÛŒ ÙÙˆÙ†Øª'
            },
            image: {
                image: 'ØªØµÙˆÛŒØ±',
                insert: 'ÙˆØ§Ø±Ø¯ Ú©Ø±Ø¯Ù† ØªØµÙˆÛŒØ±',
                resizeFull: 'ØªØºÛŒÛŒØ± Ø¨Ù‡ Ø§Ù†Ø¯Ø§Ø²Ù‡ ÛŒ Ú©Ø§Ù…Ù„',
                resizeHalf: 'ØªØºÛŒÛŒØ± Ø¨Ù‡ Ø§Ù†Ø¯Ø§Ø²Ù‡ Ù†ØµÙ',
                resizeQuarter: 'ØªØºÛŒÛŒØ± Ø¨Ù‡ Ø§Ù†Ø¯Ø§Ø²Ù‡ ÛŒÚ© Ú†Ù‡Ø§Ø±Ù…',
                floatLeft: 'Ú†Ø³Ø¨Ø§Ù†Ø¯Ù† Ø¨Ù‡ Ú†Ù¾',
                floatRight: 'Ú†Ø³Ø¨Ø§Ù†Ø¯Ù† Ø¨Ù‡ Ø±Ø§Ø³Øª',
                floatNone: 'Ø¨Ø¯ÙˆÙ† Ú†Ø³Ø¨Ù†Ø¯Ú¯ÛŒ',
                dragImageHere: 'ÛŒÚ© ØªØµÙˆÛŒØ± Ø±Ø§ Ø§ÛŒÙ†Ø¬Ø§ Ø¨Ú©Ø´ÛŒØ¯',
                selectFromFiles: 'ÙØ§ÛŒÙ„ Ù‡Ø§ Ø±Ø§ Ø§Ù†ØªØ®Ø§Ø¨ Ú©Ù†ÛŒØ¯',
                url: 'Ø¢Ø¯Ø±Ø³ ØªØµÙˆÛŒØ±',
                remove: 'Ø­Ø°Ù ØªØµÙˆÛŒØ±'
            },
            link: {
                link: 'Ù„ÛŒÙ†Ú©',
                insert: 'Ø§Ø¶Ø§ÙÙ‡ Ú©Ø±Ø¯Ù† Ù„ÛŒÙ†Ú©',
                unlink: 'Ø­Ø°Ù Ù„ÛŒÙ†Ú©',
                edit: 'ÙˆÛŒØ±Ø§ÛŒØ´',
                textToDisplay: 'Ù…ØªÙ† Ø¬Ù‡Øª Ù†Ù…Ø§ÛŒØ´',
                url: 'Ø§ÛŒÙ† Ù„ÛŒÙ†Ú© Ø¨Ù‡ Ú†Ù‡ Ø¢Ø¯Ø±Ø³ÛŒ Ø¨Ø§ÛŒØ¯ Ø¨Ø±ÙˆØ¯ ØŸ',
                openInNewWindow: 'Ø¯Ø± ÛŒÚ© Ù¾Ù†Ø¬Ø±Ù‡ ÛŒ Ø¬Ø¯ÛŒØ¯ Ø¨Ø§Ø² Ø´ÙˆØ¯'
            },
            video: {
                video: 'ÙˆÛŒØ¯ÛŒÙˆ',
                videoLink: 'Ù„ÛŒÙ†Ú© ÙˆÛŒØ¯ÛŒÙˆ',
                insert: 'Ø§ÙØ²ÙˆØ¯Ù† ÙˆÛŒØ¯ÛŒÙˆ',
                url: 'Ø¢Ø¯Ø±Ø³ ÙˆÛŒØ¯ÛŒÙˆ ØŸ',
                providers: '(YouTube, Vimeo, Vine, Instagram, DailyMotion, ÛŒØ§ Youku)'
            },
            table: {
                table: 'Ø¬Ø¯ÙˆÙ„'
            },
            hr: {
                insert: 'Ø§ÙØ²ÙˆØ¯Ù† Ø®Ø· Ø§ÙÙ‚ÛŒ'
            },
            style: {
                style: 'Ø§Ø³ØªÛŒÙ„',
                normal: 'Ù†Ø±Ù…Ø§Ù„',
                blockquote: 'Ù†Ù‚Ù„ Ù‚ÙˆÙ„',
                pre: 'Ú©Ø¯',
                h1: 'Ø³Ø±ØªÛŒØªØ± 1',
                h2: 'Ø³Ø±ØªÛŒØªØ± 2',
                h3: 'Ø³Ø±ØªÛŒØªØ± 3',
                h4: 'Ø³Ø±ØªÛŒØªØ± 4',
                h5: 'Ø³Ø±ØªÛŒØªØ± 5',
                h6: 'Ø³Ø±ØªÛŒØªØ± 6'
            },
            lists: {
                unordered: 'Ù„ÛŒØ³Øª ØºÛŒØ± ØªØ±ØªÛŒØ¨ÛŒ',
                ordered: 'Ù„ÛŒØ³Øª ØªØ±ØªÛŒØ¨ÛŒ'
            },
            options: {
                help: 'Ø±Ø§Ù‡Ù†Ù…Ø§',
                fullscreen: 'Ù†Ù…Ø§ÛŒØ´ ØªÙ…Ø§Ù… ØµÙØ­Ù‡',
                codeview: 'Ù…Ø´Ø§Ù‡Ø¯Ù‡ ÛŒ Ú©Ø¯'
            },
            paragraph: {
                paragraph: 'Ù¾Ø§Ø±Ø§Ú¯Ø±Ø§Ù',
                outdent: 'Ú©Ø§Ù‡Ø´ ØªÙˆ Ø±ÙØªÚ¯ÛŒ',
                indent: 'Ø§ÙØ²Ø§ÛŒØ´ ØªÙˆ Ø±ÙØªÚ¯ÛŒ',
                left: 'Ú†Ù¾ Ú†ÛŒÙ†',
                center: 'Ù…ÛŒØ§Ù† Ú†ÛŒÙ†',
                right: 'Ø±Ø§Ø³Øª Ú†ÛŒÙ†',
                justify: 'Ø¨Ù„ÙˆÚ© Ú†ÛŒÙ†'
            },
            color: {
                recent: 'Ø±Ù†Ú¯ Ø§Ø®ÛŒØ±Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø´Ø¯Ù‡',
                more: 'Ø±Ù†Ú¯ Ø¨ÛŒØ´ØªØ±',
                background: 'Ø±Ù†Ú¯ Ù¾Ø³ Ø²Ù…ÛŒÙ†Ù‡',
                foreground: 'Ø±Ù†Ú¯ Ù…ØªÙ†',
                transparent: 'Ø¨ÛŒ Ø±Ù†Ú¯',
                setTransparent: 'ØªÙ†Ø¸ÛŒÙ… Ø­Ø§Ù„Øª Ø¨ÛŒ Ø±Ù†Ú¯',
                reset: 'Ø¨Ø§Ø²Ù†Ø´Ø§Ù†Ø¯Ù†',
                resetToDefault: 'Ø­Ø§Ù„Øª Ù¾ÛŒØ´ ÙØ±Ø¶'
            },
            shortcut: {
                shortcuts: 'Ø¯Ú©Ù…Ù‡ Ù‡Ø§ÛŒ Ù…ÛŒØ§Ù† Ø¨Ø±',
                close: 'Ø¨Ø³ØªÙ†',
                textFormatting: 'ÙØ±Ù…Øª Ù…ØªÙ†',
                action: 'Ø¹Ù…Ù„ÛŒØ§Øª',
                paragraphFormatting: 'ÙØ±Ù…Øª Ù¾Ø§Ø±Ø§Ú¯Ø±Ø§Ù',
                documentStyle: 'Ø§Ø³ØªÛŒÙ„ Ø³Ù†Ø¯'
            },
            history: {
                undo: 'ÙˆØ§Ú†ÛŒØ¯Ù†',
                redo: 'Ø¨Ø§Ø²Ú†ÛŒØ¯Ù†'
            }
        }
});
})(jQuery);

