(function ($) {
  $.extend($.summernote.lang, {
    'sr-RS': {
      font: {
        bold: 'ÐŸÐ¾Ð´ÐµÐ±Ñ™Ð°Ð½Ð¾',
        italic: 'ÐšÑƒÑ€Ð·Ð¸Ð²',
        underline: 'ÐŸÐ¾Ð´Ð²ÑƒÑ‡ÐµÐ½Ð¾',
        strikethrough: 'ÐŸÑ€ÐµÑ†Ñ€Ñ‚Ð°Ð½Ð¾',
        clear: 'Ð£ÐºÐ»Ð¾Ð½Ð¸ ÑÑ‚Ð¸Ð»Ð¾Ð²Ðµ Ñ„Ð¾Ð½Ñ‚Ð°',
        height: 'Ð’Ð¸ÑÐ¸Ð½Ð° Ð»Ð¸Ð½Ð¸Ñ˜Ðµ',
        size: 'Ð’ÐµÐ»Ð¸Ñ‡Ð¸Ð½Ð° Ñ„Ð¾Ð½Ñ‚Ð°'
      },
      image: {
        image: 'Ð¡Ð»Ð¸ÐºÐ°',
        insert: 'Ð£Ð¼ÐµÑ‚Ð½Ð¸ ÑÐ»Ð¸ÐºÑƒ',
        resizeFull: 'ÐŸÑƒÐ½Ð° Ð²ÐµÐ»Ð¸Ñ‡Ð¸Ð½Ð°',
        resizeHalf: 'Ð£Ð¼Ð°ÑšÐ¸ Ð½Ð° 50%',
        resizeQuarter: 'Ð£Ð¼Ð°ÑšÐ¸ Ð½Ð° 25%',
        floatLeft: 'Ð£Ð· Ð»ÐµÐ²Ñƒ Ð¸Ð²Ð¸Ñ†Ñƒ',
        floatRight: 'Ð£Ð· Ð´ÐµÑÐ½Ñƒ Ð¸Ð²Ð¸Ñ†Ñƒ',
        floatNone: 'Ð‘ÐµÐ· Ñ€Ð°Ð²Ð½Ð°ÑšÐ°',
        dragImageHere: 'ÐŸÑ€ÐµÐ²ÑƒÑ†Ð¸ ÑÐ»Ð¸ÐºÑƒ Ð¾Ð²Ð´Ðµ',
        selectFromFiles: 'Ð˜Ð·Ð°Ð±ÐµÑ€Ð¸ Ð¸Ð· Ð´Ð°Ñ‚Ð¾Ñ‚ÐµÐºÐµ',
        url: 'ÐÐ´Ñ€ÐµÑÐ° ÑÐ»Ð¸ÐºÐµ',
        remove: 'Ð£ÐºÐ»Ð¾Ð½Ð¸ ÑÐ»Ð¸ÐºÑƒ'
      },
      link: {
        link: 'Ð’ÐµÐ·Ð°',
        insert: 'Ð£Ð¼ÐµÑ‚Ð½Ð¸ Ð²ÐµÐ·Ñƒ',
        unlink: 'Ð£ÐºÐ»Ð¾Ð½Ð¸ Ð²ÐµÐ·Ñƒ',
        edit: 'Ð£Ñ€ÐµÐ´Ð¸',
        textToDisplay: 'Ð¢ÐµÐºÑÑ‚ Ð·Ð° Ð¿Ñ€Ð¸ÐºÐ°Ð·',
        url: 'Ð˜Ð½Ñ‚ÐµÑ€Ð½ÐµÑ‚ Ð°Ð´Ñ€ÐµÑÐ°',
        openInNewWindow: 'ÐžÑ‚Ð²Ð¾Ñ€Ð¸ Ñƒ Ð½Ð¾Ð²Ð¾Ð¼ Ð¿Ñ€Ð¾Ð·Ð¾Ñ€Ñƒ'
      },
      video: {
        video: 'Ð’Ð¸Ð´ÐµÐ¾',
        videoLink: 'Ð’ÐµÐ·Ð° ÐºÐ° Ð²Ð¸Ð´ÐµÑƒ',
        insert: 'Ð£Ð¼ÐµÑ‚Ð½Ð¸ Ð²Ð¸Ð´ÐµÐ¾',
        url: 'URL Ð²Ð¸Ð´ÐµÐ¾',
        providers: '(YouTube, Vimeo, Vine, Instagram, DailyMotion Ð¸Ð»Ð¸ Youku)'
      },
      table: {
        table: 'Ð¢Ð°Ð±ÐµÐ»Ð°'
      },
      hr: {
        insert: 'Ð£Ð¼ÐµÑ‚Ð½Ð¸ Ñ…Ð¾Ñ€Ð¸Ð·Ð¾Ð½Ñ‚Ð°Ð»Ð½Ñƒ Ð»Ð¸Ð½Ð¸Ñ˜Ñƒ'
      },
      style: {
        style: 'Ð¡Ñ‚Ð¸Ð»',
        normal: 'ÐÐ¾Ñ€Ð¼Ð°Ð»Ð½Ð¸',
        blockquote: 'Ð¦Ð¸Ñ‚Ð°Ñ‚',
        pre: 'ÐšÐ¾Ð´',
        h1: 'Ð—Ð°Ð³Ð»Ð°Ð²Ñ™Ðµ 1',
        h2: 'Ð—Ð°Ð³Ð»Ð°Ð²Ñ™Ðµ 2',
        h3: 'Ð—Ð°Ð³Ð»Ð°Ð²Ñ™Ðµ 3',
        h4: 'Ð—Ð°Ð³Ð»Ð°Ð²Ñ™Ðµ 4',
        h5: 'Ð—Ð°Ð³Ð»Ð°Ð²Ñ™Ðµ 5',
        h6: 'Ð—Ð°Ð³Ð»Ð°Ð²Ñ™Ðµ 6'
      },
      lists: {
        unordered: 'ÐžÐ±Ð¸Ñ‡Ð½Ð° Ð»Ð¸ÑÑ‚Ð°',
        ordered: 'ÐÑƒÐ¼ÐµÑ€Ð¸ÑÐ°Ð½Ð° Ð»Ð¸ÑÑ‚Ð°'
      },
      options: {
        help: 'ÐŸÐ¾Ð¼Ð¾Ñ›',
        fullscreen: 'ÐŸÑ€ÐµÐºÐ¾ Ñ†ÐµÐ»Ð¾Ð³ ÐµÐºÑ€Ð°Ð½Ð°',
        codeview: 'Ð˜Ð·Ð²Ð¾Ñ€Ð½Ð¸ ÐºÐ¾Ð´'
      },
      paragraph: {
        paragraph: 'ÐŸÐ°Ñ€Ð°Ð³Ñ€Ð°Ñ„',
        outdent: 'Ð¡Ð¼Ð°ÑšÐ¸ ÑƒÐ²Ð»Ð°Ñ‡ÐµÑšÐµ',
        indent: 'ÐŸÐ¾Ð²ÐµÑ‡Ð°Ñ˜ ÑƒÐ²Ð»Ð°Ñ‡ÐµÑšÐµ',
        left: 'ÐŸÐ¾Ñ€Ð°Ð²Ð½Ð°Ñ˜ Ñƒ Ð»ÐµÐ²Ð¾',
        center: 'Ð¦ÐµÐ½Ñ‚Ñ€Ð¸Ñ€Ð°Ð½Ð¾',
        right: 'ÐŸÐ¾Ñ€Ð°Ð²Ð½Ð°Ñ˜ Ñƒ Ð´ÐµÑÐ½Ð¾',
        justify: 'ÐŸÐ¾Ñ€Ð°Ð²Ð½Ð°Ñ˜ Ð¾Ð±Ð¾ÑÑ‚Ñ€Ð°Ð½Ð¾'
      },
      color: {
        recent: 'ÐŸÐ¾ÑÐ»ÐµÐ´ÑšÐ° Ð±Ð¾Ñ˜Ð°',
        more: 'Ð’Ð¸ÑˆÐµ Ð±Ð¾Ñ˜Ð°',
        background: 'Ð‘Ð¾Ñ˜Ð° Ð¿Ð¾Ð·Ð°Ð´Ð¸Ð½Ðµ',
        foreground: 'Ð‘Ð¾Ñ˜Ð° Ñ‚ÐµÐºÑÑ‚Ð°',
        transparent: 'ÐŸÑ€Ð¾Ð²Ð¸Ð´Ð½Ð°',
        setTransparent: 'ÐŸÑ€Ð¾Ð²Ð¸Ð´Ð½Ð°',
        reset: 'ÐžÐ¿Ð¾Ð·Ð¸Ð²',
        resetToDefault: 'ÐŸÐ¾Ð´Ñ€Ð°Ð·ÑƒÐ¼ÐµÐ²Ð°Ð½Ð°'
      },
      shortcut: {
        shortcuts: 'ÐŸÑ€ÐµÑ‡Ð¸Ñ†Ðµ ÑÐ° Ñ‚Ð°ÑÑ‚Ð°Ñ‚ÑƒÑ€Ðµ',
        close: 'Ð—Ð°Ñ‚Ð²Ð¾Ñ€Ð¸',
        textFormatting: 'Ð¤Ð¾Ñ€Ð¼Ð°Ñ‚Ð¸Ñ€Ð°ÑšÐµ Ñ‚ÐµÐºÑÑ‚Ð°',
        action: 'ÐÐºÑ†Ð¸Ñ˜Ð°',
        paragraphFormatting: 'Ð¤Ð¾Ñ€Ð¼Ð°Ñ‚Ð¸Ñ€Ð°ÑšÐµ Ð¿Ð°Ñ€Ð°Ð³Ñ€Ð°Ñ„Ð°',
        documentStyle: 'Ð¡Ñ‚Ð¸Ð» Ð´Ð¾ÐºÑƒÐ¼ÐµÐ½Ñ‚Ð°',
        extraKeys: 'Ð”Ð¾Ð´Ð°Ñ‚Ð½Ðµ ÐºÐ¾Ð¼Ð±Ð¸Ð½Ð°Ñ†Ð¸Ñ˜Ðµ'
      },
      history: {
        undo: 'ÐŸÐ¾Ð½Ð¸ÑˆÑ‚Ð¸',
        redo: 'ÐŸÐ¾Ð½Ð¾Ð²Ð¸'
      }
    }
  });
})(jQuery);
